RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/MIMXRT1050/MIMXRT1052/utilities/fsl_shell.c
                /* Normal character */
                if (shellContextHandle->c_pos < shellContextHandle->l_pos)
                {
                    memmove(&shellContextHandle->line[shellContextHandle->c_pos + 1],
                            &shellContextHandle->line[shellContextHandle->c_pos],
                            shellContextHandle->l_pos - shellContextHandle->c_pos);
                    shellContextHandle->line[shellContextHandle->c_pos] = ch;
                    SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                                strlen(&shellContextHandle->line[shellContextHandle->c_pos]));
                    /* Move the cursor to new position */
                    for (int i = shellContextHandle->c_pos; i < shellContextHandle->l_pos; i++)
                    {
                        SHELL_Write(shellContextHandle, "\b", 1);
                    }
                }
                else
                {
                    shellContextHandle->line[shellContextHandle->l_pos] = ch;
                    SHELL_Write(shellContextHandle, &shellContextHandle->line[shellContextHandle->l_pos], 1);
                }

                ch = 0;
                shellContextHandle->l_pos++;
                shellContextHandle->c_pos++;
            } while (!shellContextHandle->exit);
        }
#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))

#if defined(OSA_USED)

#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
#else
            }
        } while (gUseRtos_c);
#endif

#endif

#endif
    }
}

static shell_status_t SHELL_HelpCommand(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    shell_context_handle_t *shellContextHandle = (shell_context_handle_t *)shellHandle;
    shell_command_t *shellCommandContextHandle;
    list_element_handle_t p = LIST_GetHead(&shellContextHandle->commandContextListHead);

    while (p)
    {
        shellCommandContextHandle = SHEEL_COMMAND_POINTER(p);
        if (shellCommandContextHandle->pcHelpString && strlen(shellCommandContextHandle->pcHelpString))
        {
            SHELL_Write(shellContextHandle, shellCommandContextHandle->pcHelpString,
                        strlen(shellCommandContextHandle->pcHelpString));
        }

        p = LIST_GetNext(p);
    }
    return kStatus_SHELL_Success;
}

static shell_status_t SHELL_ExitCommand(shell_handle_t shellHandle, int32_t argc, char **argv)
{
    shell_context_handle_t *shellContextHandle = (shell_context_handle_t *)shellHandle;
    /* Skip warning */
    SHELL_Write(shellContextHandle, "\r\nSHELL exited\r\n", strlen("\r\nSHELL exited\r\n"));
    shellContextHandle->exit = true;
    return kStatus_SHELL_Success;
}

static void SHELL_ProcessCommand(shell_context_handle_t *shellContextHandle, const char *cmd)
{
    shell_command_t *tmpCommand = NULL;
    const char *tmpCommandString;
    int32_t argc;
    char *argv[SHELL_BUFFER_SIZE];
    list_element_handle_t p;
    uint8_t flag = 1;
    uint8_t tmpCommandLen;
    uint8_t tmpLen;
    uint8_t i = 0;

    tmpLen = strlen(cmd);
    argc = SHELL_ParseLine(cmd, tmpLen, argv);

    if ((tmpCommand == NULL) && (argc > 0))
    {
        p = LIST_GetHead(&shellContextHandle->commandContextListHead);
        while (p)
        {
            tmpCommand = SHEEL_COMMAND_POINTER(p);
            tmpCommandString = tmpCommand->pcCommand;
            tmpCommandLen = strlen(tmpCommandString);
            /* Compare with space or end of string */
            if ((cmd[tmpCommandLen] == ' ') || (cmd[tmpCommandLen] == 0x00))
            {
                if (SHELL_StringCompare(tmpCommandString, argv[0], tmpCommandLen) == 0)
                {
                    /* support commands with optional number of parameters */
                    if (tmpCommand->cExpectedNumberOfParameters == SHELL_IGNORE_PARAMETER_COUNT)
                    {
                        flag = 0;
                    }
                    else if ((tmpCommand->cExpectedNumberOfParameters == 0) && (argc == 1))
                    {
                        flag = 0;
                    }
                    else if (tmpCommand->cExpectedNumberOfParameters > 0)
                    {
                        if ((argc - 1) == tmpCommand->cExpectedNumberOfParameters)
                        {
                            flag = 0;
                        }
                    }
                    else
                    {
                        flag = 1;
                    }
                    break;
                }
            }
            p = LIST_GetNext(p);
        }
    }

    if ((tmpCommand != NULL) && (flag == 1U))
    {
        SHELL_Write(
            shellContextHandle,
            "\r\nIncorrect command parameter(s).  Enter \"help\" to view a list of available commands.\r\n\r\n",
            strlen(
                "\r\nIncorrect command parameter(s).  Enter \"help\" to view a list of available commands.\r\n\r\n"));
        tmpCommand = NULL;
    }
    else if (tmpCommand != NULL)
    {
        tmpLen = strlen(cmd);
        /* Compare with last command. Push back to history buffer if different */
        if (tmpLen != SHELL_StringCompare(cmd, shellContextHandle->hist_buf[0], strlen(cmd)))
        {
            for (i = SHELL_HISTORY_COUNT - 1; i > 0; i--)
            {
                memset(shellContextHandle->hist_buf[i], '\0', SHELL_BUFFER_SIZE);
                tmpLen = strlen(shellContextHandle->hist_buf[i - 1]);
                memcpy(shellContextHandle->hist_buf[i], shellContextHandle->hist_buf[i - 1], tmpLen);
            }
            memset(shellContextHandle->hist_buf[0], '\0', SHELL_BUFFER_SIZE);
            tmpLen = strlen(cmd);
            memcpy(shellContextHandle->hist_buf[0], cmd, tmpLen);
            if (shellContextHandle->hist_count < SHELL_HISTORY_COUNT)
            {
                shellContextHandle->hist_count++;
            }
        }
        tmpCommand->pFuncCallBack(shellContextHandle, argc, argv);
        tmpCommand = NULL;
    }
    else
    {
        SHELL_Write(shellContextHandle,
                    "\r\nCommand not recognized.  Enter 'help' to view a list of available commands.\r\n\r\n",
                    strlen("\r\nCommand not recognized.  Enter 'help' to view a list of available commands.\r\n\r\n"));
        tmpCommand = NULL;
    }
}

static void SHELL_GetHistoryCommand(shell_context_handle_t *shellContextHandle, uint8_t hist_pos)
{
    uint8_t i;
    uint32_t tmp;

    if (shellContextHandle->hist_buf[0][0] == '\0')
    {
        shellContextHandle->hist_current = 0;
        return;
    }
    if (hist_pos >= SHELL_HISTORY_COUNT)
    {
        hist_pos = SHELL_HISTORY_COUNT - 1;
    }
    tmp = strlen(shellContextHandle->line);
    /* Clear current if have */
    if (tmp > 0)
    {
        memset(shellContextHandle->line, '\0', tmp);
        for (i = 0; i < tmp; i++)
        {
            SHELL_Write(shellContextHandle, "\b \b", 3);
        }
    }

    shellContextHandle->l_pos = strlen(shellContextHandle->hist_buf[hist_pos]);
    shellContextHandle->c_pos = shellContextHandle->l_pos;
    memcpy(shellContextHandle->line, shellContextHandle->hist_buf[hist_pos], shellContextHandle->l_pos);
    SHELL_Write(shellContextHandle, shellContextHandle->hist_buf[hist_pos],
                strlen(shellContextHandle->hist_buf[hist_pos]));
}

static void SHELL_AutoComplete(shell_context_handle_t *shellContextHandle)
{
    int32_t len;
    int32_t minLen;
    list_element_handle_t p;
    shell_command_t *tmpCommand = NULL;
    const char *namePtr;
    const char *cmdName;

    minLen = 0;
    namePtr = NULL;

    if (!strlen(shellContextHandle->line))
    {
        return;
    }
    SHELL_Write(shellContextHandle, "\r\n", 2);
    /* Empty tab, list all commands */
    if (shellContextHandle->line[0] == '\0')
    {
        SHELL_HelpCommand(shellContextHandle, 0, NULL);
        return;
    }
    /* Do auto complete */
    p = LIST_GetHead(&shellContextHandle->commandContextListHead);
    while (p)
    {
        tmpCommand = SHEEL_COMMAND_POINTER(p);
        cmdName = tmpCommand->pcCommand;
        if (SHELL_StringCompare(shellContextHandle->line, cmdName, strlen(shellContextHandle->line)) == 0)
        {
            if (minLen == 0)
            {
                namePtr = cmdName;
                minLen = strlen(namePtr);
                /* Show possible matches */
                SHELL_Write(shellContextHandle, (char *)cmdName, strlen(cmdName));
                SHELL_Write(shellContextHandle, "\r\n", 2);
                continue;
            }
            len = SHELL_StringCompare(namePtr, cmdName, strlen(namePtr));
            if (len < 0)
            {
                len = len * (-1);
            }
            if (len < minLen)
            {
                minLen = len;
            }
        }
        p = LIST_GetNext(p);
    }
    /* Auto complete string */
    if (namePtr)
    {
        memcpy(shellContextHandle->line, namePtr, minLen);
    }
    SHELL_Write(shellContextHandle, shellContextHandle->prompt, strlen(shellContextHandle->prompt));
    SHELL_Write(shellContextHandle, shellContextHandle->line, strlen(shellContextHandle->line));
    return;
}

